MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA306/mcu.h
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile uint16_t DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile uint16_t DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile uint16_t DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile uint16_t DMACNT5 __attribute__((__sfr__));
#define ANCFG ANCFG
extern volatile uint16_t ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  uint16_t VBGEN:1;
  uint16_t VBG2EN:1;
  uint16_t VBG6EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define ANSD ANSD
extern volatile uint16_t ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t :2;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t :2;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t :2;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t :2;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile uint16_t ANSE __attribute__((__sfr__));
__extension__ typedef struct tagANSEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
__extension__ typedef struct tagANSELEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
__extension__ typedef struct tagANSELGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define ANSG ANSG
extern volatile uint16_t ANSG __attribute__((__sfr__));
__extension__ typedef struct tagANSGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSGBITS;
extern volatile ANSGBITS ANSGbits __attribute__((__sfr__));

#define LCDREG LCDREG
extern volatile uint16_t LCDREG __attribute__((__sfr__));
__extension__ typedef struct tagLCDREGBITS {
  union {
    struct {
      uint16_t CKSEL:2;
      uint16_t MODE13:1;
      uint16_t BIAS:3;
      uint16_t :9;
      uint16_t CPEN:1;
    };
    struct {
      uint16_t CKSEL0:1;
      uint16_t CKSEL1:1;
      uint16_t :1;
      uint16_t BIAS0:1;
      uint16_t BIAS1:1;
      uint16_t BIAS2:1;
    };
  };
} LCDREGBITS;
extern volatile LCDREGBITS LCDREGbits __attribute__((__sfr__));

#define LCDREF LCDREF
extern volatile uint16_t LCDREF __attribute__((__sfr__));
__extension__ typedef struct tagLCDREFBITS {
  union {
    struct {
      uint16_t LRLAT:3;
      uint16_t :1;
      uint16_t LRLBP:2;
      uint16_t LRLAP:2;
      uint16_t VLCD1PE:1;
      uint16_t VLCD2PE:1;
      uint16_t VLCD3PE:1;
      uint16_t LCDCST:3;
      uint16_t :1;
      uint16_t LCDIRE:1;
    };
    struct {
      uint16_t LRLAT0:1;
      uint16_t LRLAT1:1;
      uint16_t LRLAT2:1;
      uint16_t :1;
      uint16_t LRLBP0:1;
      uint16_t LRLBP1:1;
      uint16_t LRLAP0:1;
      uint16_t LRLAP1:1;
      uint16_t :3;
      uint16_t LCDCST0:1;
      uint16_t LCDCST1:1;
      uint16_t LCDCST2:1;
    };
  };
} LCDREFBITS;
extern volatile LCDREFBITS LCDREFbits __attribute__((__sfr__));

#define LCDCON LCDCON
extern volatile uint16_t LCDCON __attribute__((__sfr__));
__extension__ typedef struct tagLCDCONBITS {
  union {
    struct {
      uint16_t LMUX:3;
      uint16_t CS:2;
      uint16_t WERR:1;
      uint16_t SLPEN:1;
      uint16_t :6;
      uint16_t LCDSIDL:1;
      uint16_t :1;
      uint16_t LCDEN:1;
    };
    struct {
      uint16_t LMUX0:1;
      uint16_t LMUX1:1;
      uint16_t LMUX2:1;
      uint16_t CS0:1;
      uint16_t CS1:1;
    };
  };
} LCDCONBITS;
extern volatile LCDCONBITS LCDCONbits __attribute__((__sfr__));

#define LCDPS LCDPS
extern volatile uint16_t LCDPS __attribute__((__sfr__));
__extension__ typedef struct tagLCDPSBITS {
  union {
    struct {
      uint16_t LP:4;
      uint16_t WA:1;
      uint16_t LCDA:1;
      uint16_t BIASMD:1;
      uint16_t WFT:1;
    };
    struct {
      uint16_t LP0:1;
      uint16_t LP1:1;
      uint16_t LP2:1;
      uint16_t LP3:1;
    };
  };
} LCDPSBITS;
extern volatile LCDPSBITS LCDPSbits __attribute__((__sfr__));

#define LCDSE0 LCDSE0
extern volatile uint16_t LCDSE0 __attribute__((__sfr__));
typedef struct tagLCDSE0BITS {
  uint16_t SE00:1;
  uint16_t SE01:1;
  uint16_t SE02:1;
  uint16_t SE03:1;
  uint16_t SE04:1;
  uint16_t SE05:1;
  uint16_t SE06:1;
  uint16_t SE07:1;
  uint16_t SE08:1;
  uint16_t SE09:1;
  uint16_t SE10:1;
  uint16_t SE11:1;
  uint16_t SE12:1;
  uint16_t SE13:1;
  uint16_t SE14:1;
  uint16_t SE15:1;
} LCDSE0BITS;
extern volatile LCDSE0BITS LCDSE0bits __attribute__((__sfr__));

#define LCDSE1 LCDSE1
extern volatile uint16_t LCDSE1 __attribute__((__sfr__));
typedef struct tagLCDSE1BITS {
  uint16_t SE16:1;
  uint16_t SE17:1;
  uint16_t SE18:1;
  uint16_t SE19:1;
  uint16_t SE20:1;
  uint16_t SE21:1;
  uint16_t SE22:1;
  uint16_t SE23:1;
  uint16_t SE24:1;
  uint16_t SE25:1;
  uint16_t SE26:1;
  uint16_t SE27:1;
  uint16_t SE28:1;
  uint16_t SE29:1;
  uint16_t SE30:1;
  uint16_t SE31:1;
} LCDSE1BITS;
extern volatile LCDSE1BITS LCDSE1bits __attribute__((__sfr__));

#define LCDSE2 LCDSE2
extern volatile uint16_t LCDSE2 __attribute__((__sfr__));
typedef struct tagLCDSE2BITS {
  uint16_t :15;
  uint16_t SE47:1;
} LCDSE2BITS;
extern volatile LCDSE2BITS LCDSE2bits __attribute__((__sfr__));

#define LCDSE3 LCDSE3
extern volatile uint16_t LCDSE3 __attribute__((__sfr__));
typedef struct tagLCDSE3BITS {
  uint16_t SE48:1;
} LCDSE3BITS;
extern volatile LCDSE3BITS LCDSE3bits __attribute__((__sfr__));

#define LCDDATA0 LCDDATA0
extern volatile uint16_t LCDDATA0 __attribute__((__sfr__));
typedef struct tagLCDDATA0BITS {
  uint16_t S00C0:1;
  uint16_t S01C0:1;
  uint16_t S02C0:1;
  uint16_t S03C0:1;
  uint16_t S04C0:1;
  uint16_t S05C0:1;
  uint16_t S06C0:1;
  uint16_t S07C0:1;
  uint16_t S08C0:1;
  uint16_t S09C0:1;
  uint16_t S10C0:1;
  uint16_t S11C0:1;
  uint16_t S12C0:1;
  uint16_t S13C0:1;
  uint16_t S14C0:1;
  uint16_t S15C0:1;
} LCDDATA0BITS;
extern volatile LCDDATA0BITS LCDDATA0bits __attribute__((__sfr__));

#define LCDDATA1 LCDDATA1
extern volatile uint16_t LCDDATA1 __attribute__((__sfr__));
typedef struct tagLCDDATA1BITS {
  uint16_t S16C0:1;
  uint16_t S17C0:1;
  uint16_t S18C0:1;
  uint16_t S19C0:1;
  uint16_t S20C0:1;
  uint16_t S21C0:1;
  uint16_t S22C0:1;
  uint16_t S23C0:1;
  uint16_t S24C0:1;
  uint16_t S25C0:1;
  uint16_t S26C0:1;
  uint16_t S27C0:1;
  uint16_t S28C0:1;
  uint16_t S29C0:1;
  uint16_t S30C0:1;
  uint16_t S31C0:1;
} LCDDATA1BITS;
extern volatile LCDDATA1BITS LCDDATA1bits __attribute__((__sfr__));

#define LCDDATA2 LCDDATA2
extern volatile uint16_t LCDDATA2 __attribute__((__sfr__));
typedef struct tagLCDDATA2BITS {
  uint16_t :15;
  uint16_t S47C0:1;
} LCDDATA2BITS;
extern volatile LCDDATA2BITS LCDDATA2bits __attribute__((__sfr__));

#define LCDDATA3 LCDDATA3
extern volatile uint16_t LCDDATA3 __attribute__((__sfr__));
typedef struct tagLCDDATA3BITS {
  uint16_t S48C0:1;
} LCDDATA3BITS;
