MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA306/mcu.h
#define _LCDDATA28_S14C7_POSITION                0x0000000E
#define _LCDDATA28_S14C7_MASK                    0x00004000
#define _LCDDATA28_S14C7_LENGTH                  0x00000001

#define _LCDDATA28_S15C7_POSITION                0x0000000F
#define _LCDDATA28_S15C7_MASK                    0x00008000
#define _LCDDATA28_S15C7_LENGTH                  0x00000001

#define _LCDDATA29_S16C7_POSITION                0x00000000
#define _LCDDATA29_S16C7_MASK                    0x00000001
#define _LCDDATA29_S16C7_LENGTH                  0x00000001

#define _LCDDATA29_S17C7_POSITION                0x00000001
#define _LCDDATA29_S17C7_MASK                    0x00000002
#define _LCDDATA29_S17C7_LENGTH                  0x00000001

#define _LCDDATA29_S18C7_POSITION                0x00000002
#define _LCDDATA29_S18C7_MASK                    0x00000004
#define _LCDDATA29_S18C7_LENGTH                  0x00000001

#define _LCDDATA29_S19C7_POSITION                0x00000003
#define _LCDDATA29_S19C7_MASK                    0x00000008
#define _LCDDATA29_S19C7_LENGTH                  0x00000001

#define _LCDDATA29_S20C7_POSITION                0x00000004
#define _LCDDATA29_S20C7_MASK                    0x00000010
#define _LCDDATA29_S20C7_LENGTH                  0x00000001

#define _LCDDATA29_S21C7_POSITION                0x00000005
#define _LCDDATA29_S21C7_MASK                    0x00000020
#define _LCDDATA29_S21C7_LENGTH                  0x00000001

#define _LCDDATA29_S22C7_POSITION                0x00000006
#define _LCDDATA29_S22C7_MASK                    0x00000040
#define _LCDDATA29_S22C7_LENGTH                  0x00000001

#define _LCDDATA29_S23C7_POSITION                0x00000007
#define _LCDDATA29_S23C7_MASK                    0x00000080
#define _LCDDATA29_S23C7_LENGTH                  0x00000001

#define _LCDDATA29_S24C7_POSITION                0x00000008
#define _LCDDATA29_S24C7_MASK                    0x00000100
#define _LCDDATA29_S24C7_LENGTH                  0x00000001

#define _LCDDATA29_S25C7_POSITION                0x00000009
#define _LCDDATA29_S25C7_MASK                    0x00000200
#define _LCDDATA29_S25C7_LENGTH                  0x00000001

#define _LCDDATA29_S26C7_POSITION                0x0000000A
#define _LCDDATA29_S26C7_MASK                    0x00000400
#define _LCDDATA29_S26C7_LENGTH                  0x00000001

#define _LCDDATA29_S27C7_POSITION                0x0000000B
#define _LCDDATA29_S27C7_MASK                    0x00000800
#define _LCDDATA29_S27C7_LENGTH                  0x00000001

#define _LCDDATA29_S28C7_POSITION                0x0000000C
#define _LCDDATA29_S28C7_MASK                    0x00001000
#define _LCDDATA29_S28C7_LENGTH                  0x00000001

#define _LCDDATA29_S29C7_POSITION                0x0000000D
#define _LCDDATA29_S29C7_MASK                    0x00002000
#define _LCDDATA29_S29C7_LENGTH                  0x00000001

#define _LCDDATA29_S30C7_POSITION                0x0000000E
#define _LCDDATA29_S30C7_MASK                    0x00004000
#define _LCDDATA29_S30C7_LENGTH                  0x00000001

#define _LCDDATA29_S31C7_POSITION                0x0000000F
#define _LCDDATA29_S31C7_MASK                    0x00008000
#define _LCDDATA29_S31C7_LENGTH                  0x00000001

#define _LCDDATA30_S47C7_POSITION                0x0000000F
#define _LCDDATA30_S47C7_MASK                    0x00008000
#define _LCDDATA30_S47C7_LENGTH                  0x00000001

#define _LCDDATA31_S48C7_POSITION                0x00000000
#define _LCDDATA31_S48C7_MASK                    0x00000001
#define _LCDDATA31_S48C7_LENGTH                  0x00000001

#define _PMCON1_IRQM_POSITION                    0x00000000
#define _PMCON1_IRQM_MASK                        0x00000003
#define _PMCON1_IRQM_LENGTH                      0x00000002

#define _PMCON1_BUSKEEP_POSITION                 0x00000002
#define _PMCON1_BUSKEEP_MASK                     0x00000004
#define _PMCON1_BUSKEEP_LENGTH                   0x00000001

#define _PMCON1_ALMODE_POSITION                  0x00000004
#define _PMCON1_ALMODE_MASK                      0x00000010
#define _PMCON1_ALMODE_LENGTH                    0x00000001

#define _PMCON1_ALP_POSITION                     0x00000005
#define _PMCON1_ALP_MASK                         0x00000020
#define _PMCON1_ALP_LENGTH                       0x00000001

#define _PMCON1_CSF_POSITION                     0x00000006
#define _PMCON1_CSF_MASK                         0x000000C0
#define _PMCON1_CSF_LENGTH                       0x00000002

#define _PMCON1_MODE_POSITION                    0x00000008
#define _PMCON1_MODE_MASK                        0x00000300
#define _PMCON1_MODE_LENGTH                      0x00000002

#define _PMCON1_ADRMUX_POSITION                  0x0000000B
#define _PMCON1_ADRMUX_MASK                      0x00001800
#define _PMCON1_ADRMUX_LENGTH                    0x00000002

#define _PMCON1_PSIDL_POSITION                   0x0000000D
#define _PMCON1_PSIDL_MASK                       0x00002000
#define _PMCON1_PSIDL_LENGTH                     0x00000001

#define _PMCON1_PMPEN_POSITION                   0x0000000F
#define _PMCON1_PMPEN_MASK                       0x00008000
#define _PMCON1_PMPEN_LENGTH                     0x00000001

#define _PMCON1_IRQM0_POSITION                   0x00000000
#define _PMCON1_IRQM0_MASK                       0x00000001
#define _PMCON1_IRQM0_LENGTH                     0x00000001

#define _PMCON1_IRQM1_POSITION                   0x00000001
#define _PMCON1_IRQM1_MASK                       0x00000002
#define _PMCON1_IRQM1_LENGTH                     0x00000001

#define _PMCON1_CSF0_POSITION                    0x00000006
#define _PMCON1_CSF0_MASK                        0x00000040
#define _PMCON1_CSF0_LENGTH                      0x00000001

#define _PMCON1_CSF1_POSITION                    0x00000007
#define _PMCON1_CSF1_MASK                        0x00000080
#define _PMCON1_CSF1_LENGTH                      0x00000001

#define _PMCON1_MODE0_POSITION                   0x00000008
#define _PMCON1_MODE0_MASK                       0x00000100
#define _PMCON1_MODE0_LENGTH                     0x00000001

